
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Основной.Записывать = Истина;
	Движения.Основной.Записать();
	
	цЗапись = РегистрыСведений.ЦеныТоваров.СоздатьНаборЗаписей();
	цЗапись.Отбор.Регистратор.Установить(ССылка);
	
	
	
	Блокировка = Новый БлокировкаДанных;
	Элемент = Блокировка.Добавить("РегистрБухгалтерии.Основной");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Элемент.УстановитьЗначение("Счет", ПланыСчетов.Основной.Товары);
	Элемент.ИсточникДанных = Товары;
	Элемент.ИспользоватьИзИсточникаДанных(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура, "Номенклатура");
	Блокировка.Заблокировать();
	
	БлокировкаРН = Новый БлокировкаДанных;
	ЭлементРН = БлокировкаРН.Добавить("РегистрНакопления.ОстаткиТоваров");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	//Элемент.УстановитьЗначение("Номенклатура"
	ЭлементРН.ИсточникДанных = Товары;
	ЭлементРН.ИспользоватьИзИсточникаДанных("Номенклатура" , "Номенклатура");
	БлокировкаРН.Заблокировать();
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТоваровТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ПродажаТоваровТовары.Количество) КАК Количество,
		|	СРЕДНЕЕ(ПродажаТоваровТовары.Цена) КАК Цена,
		|	СУММА(ПродажаТоваровТовары.Сумма) КАК Сумма
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
		|ГДЕ
		|	ПродажаТоваровТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТоваровТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.Номенклатура КАК Номенклатура,
		|	втТовары.Количество КАК Количество,
		|	втТовары.Цена КАК Цена,
		|	втТовары.Сумма КАК Сумма,
		|	ЕСТЬNULL(ОстаткиТоваров.КоличествоОстаток, 0) КАК Остаток,
		|	ЕСТЬNULL(БухОстатки.СуммаОстатокДт, 0) КАК СуммаОстаток
		|ИЗ
		|	втТовары КАК втТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						втТовары.Номенклатура КАК Номенклатура
		|					ИЗ
		|						втТовары КАК втТовары)) КАК ОстаткиТоваров
		|		ПО втТовары.Номенклатура = ОстаткиТоваров.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Основной.Остатки(
		|				&МоментВремени,
		|				Счет = &Счет,
		|				&МассивСубконто,
		|				Субконто1 В
		|					(ВЫБРАТЬ
		|						втТовары.Номенклатура КАК Номенклатура
		|					ИЗ
		|						втТовары КАК втТовары)) КАК БухОстатки
		|		ПО втТовары.Номенклатура = БухОстатки.Субконто1";
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	Запрос.УстановитьПараметр("МассивСубконто", МассивСубконто);
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Основной.Товары);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > Выборка.Остаток Тогда
			Сообщить("Не хватает остатка...");
			Отказ= Истина;
			Прервать;
		КонецЕсли;	
		
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.РАсход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВЫборка.Номенклатура;
		Движение.Количество = ВЫборка.Количество;
		
		Движение = Движения.Основной.Добавить();
		Движение.Период = Дата;
		Движение.СчетКт = ПланыСчетов.Основной.Товары;		
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
		Движение.СчетДт = ПланыСчетов.Основной.Доход;
		Движение.Сумма = Выборка.СуммаОстаток *(ВЫборка.Количество/Выборка.Остаток);
		
		Движение = Движения.Основной.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = ПланыСчетов.Основной.РасчетыСКонтрагентами;		
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Партнеры] = Партнер;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договор] = Договор;
		Движение.СчетКт = ПланыСчетов.Основной.Себестоимость;
		Движение.Сумма = Выборка.Сумма;
		
		Запись = цЗапись.Добавить();
		Запись.Период = Дата;
		Запись.Номенклатура = Выборка.Номенклатура;
		Запись.ЦенаПродажи = Выборка.Цена;
		Запись.Регистратор = Ссылка;
		
	КонецЦикла;
	
	цЗапись.Записать();

КонецПроцедуры
