
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Основной.Записывать = Истина;
	
	цЗапись = РегистрыСведений.ЦеныТоваров.СоздатьНаборЗаписей();
	цЗапись.Отбор.Регистратор.Установить(ССылка);
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
		
		Движение = Движения.Основной.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = ПланыСчетов.Основной.Товары;		
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ТекСтрокаТовары.Номенклатура;
		Движение.СчетКт = ПланыСчетов.Основной.РасчетыСКонтрагентами;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Партнеры] = Партнер;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договор] = Договор;		
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		
		Запись = цЗапись.Добавить();
		Запись.Период = Дата;
		Запись.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Запись.ЦенаПокупки = ТекСтрокаТовары.Цена;
		Запись.Регистратор = Ссылка;
		
	КонецЦикла;
	
	цЗапись.Записать();


КонецПроцедуры
